import React, { useState } from 'react';
import './style.scss';
import ArrowForwardIosIcon from '@mui/icons-material/ArrowForwardIos';


const faqData = [
  {
    question: 'Правила закупки',
    answer: 'Мы специализируемся на оптовой продаже товаров для цветочных магазинов. Наши клиенты приходят на цветочную базу и самостоятельно выбирают нужные позиции: цветы, комнатные растения, упаковочные материалы и многое другое. После этого товары собирают в тележку и подходят к зоне диктовки, где сотрудник фиксирует все позиции для оформления накладной. Затем производится оплата и выдача заказа. Мы в основном работаем с оптовыми клиентами и обрабатываем большие заказы с широким ассортиментом. Минимальная сумма заказа для оптовых цен — от 30 000 рублей. Для уточнения рекомендуем позвонить в главный офис.'
  },
  {
    question: 'Как стать клиентом Golden Flowers',
    answer: 'Чтобы стать нашим клиентом, достаточно регулярно закупаться у нас и иметь собственный цветочный магазин. Мы рекомендуем сохранять накладные или фотографировать их, чтобы при последующих визитах вы могли подтвердить, что делаете у нас закупки. Спустя достаточно времени активного сотрудничества мы можем оформить вас как постоянного клиента. Наши клиенты получают преимущества в виде дополнительных скидок и специальных предложений. Для уточнения рекомендуем позвонить в главный офис.'
  },
  {
    question: 'Как можно оставить заказ',
    answer: 'Вы можете оформить заказ заранее, если сумма заказа превышает 30 000 рублей. Мы формируем заказы с разнообразным ассортиментом — в основном это крупные заказы. Когда заказ готов, мы сообщаем вам, и вы приезжаете на базу, чтобы лично осмотреть товар, оплатить и забрать его. Также вы можете вызвать такси или курьера для самовывоза. Для этого можно написать в отдел Сбора заказов или конкретному отделу.'
  },
  {
    question: 'Продаем ли в розницу',
    answer: 'Да, мы продаем в розницу. Несмотря на то, что мы являемся оптовым складом и в основном работаем с оптовыми клиентами, у нас есть возможность покупки в розницу. Для розничных покупателей действует наценка составляет 25% к оптовым ценам.'
  },
  {
    question: 'Что делать если товар бракован',
    answer: 'В соответствии с Законом Российской Федерации «О защите прав потребителей» от 07.02.1992 № 2300-1 (в ред. от 25.10.2007 г.) и Постановлением Правительства Российской Федерации от 31.12.2020 года №2463. срезанные цветы и горшечные растения обмену и возврату не подлежат (указаны в Перечне непродовольственных товаров надлежащего качества, не подлежащих возврату или обмену). Поменять непонравившийся товар или отказаться от его приобретения можно в магазине только в момент покупки. Мы всегда советуем нашим клиентам внимательно проверять качество товара перед покупкой. На накладной и на территории базы размещена информация о том, что свежесрезанные цветы и растения необходимо осматривать заранее. Ответственность за проверку качества лежит на покупателе до момента оформления накладной и оплаты. После покупки цветы и растения возврату или обмену не подлежат.'
  }
];

const FAQWrapper = () => {
  const [openIndex, setOpenIndex] = useState(null);

  const toggle = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <div className="faq-wrapper ">
      {faqData.map((item, index) => (
        <div key={index} className="faq-item glass">
          <div className="faq-question" onClick={() => toggle(index)}>
            <span>{item.question}</span>
            <span className={`arrow ${openIndex === index ? 'open' : ''}`}><ArrowForwardIosIcon /></span>
          </div>
          {openIndex === index && <div className="faq-answer">{item.answer}</div>}
        </div>
      ))}
    </div>
  );
};

export default FAQWrapper;
